In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv('/workspaces/ML-Assignment5/layoffs_and_stocks.csv')
data.head()

,DATE,sector,layoffs,ticker,Date,price,log_return
0,2000-12-01,Accommodation and Food Services,133,XLY,2000-12-01,19.431828,NaN
1,2001-01-01,Accommodation and Food Services,191,XLY,2001-01-01,21.745836,0.119083
2,2001-02-01,Accommodation and Food Services,93,XLY,2001-02-01,20.193089,-0.071404
3,2001-03-01,Accommodation and Food Services,207,XLY,2001-03-01,19.858204,-0.016584
4,2001-04-01,Accommodation and Food Services,257,XLY,2001-04-01,20.821493,0.048508

In [4]:
data['DATE'] = pd.to_datetime(data['DATE'])
data['year'] = data['DATE'].dt.year
year_frequency = data['year'].value_counts()
print(year_frequency)

year
2012    216
2001    216
2022    216
2021    216
2020    216
2019    216
2018    216
2017    216
2016    216
2015    216
2014    216
2013    216
2023    216
2011    216
2010    216
2009    216
2008    216
2007    216
2006    216
2005    216
2004    216
2003    216
2002    216
2000     18
Name: count, dtype: int64

In [5]:
data['sector'].value_counts()

sector
Accommodation and Food Services               277
Arts, Entertainment, and Recreation           277
Trade, Transportation, and Utilities          277
State and Local                               277
Retail Trade                                  277
Real Estate and Rental and Leasing            277
Professional and Business Services            277
Mining and Logging                            277
Manufacturing                                 277
Leisure and Hospitality                       277
Information                                   277
Health Care and Social Assistance             277
Government                                    277
Financial Activities                          277
Finance and Insurance                         277
Education and Health Services                 277
Construction                                  277
Transportation, Warehousing, and Utilities    277
Name: count, dtype: int64

In [6]:
filtered_data = data[data['sector'] == 'Accommodation and Food Services']
year_frequency = filtered_data['year'].value_counts()
print(year_frequency)

year
2012    12
2001    12
2022    12
2021    12
2020    12
2019    12
2018    12
2017    12
2016    12
2015    12
2014    12
2013    12
2023    12
2011    12
2010    12
2009    12
2008    12
2007    12
2006    12
2005    12
2004    12
2003    12
2002    12
2000     1
Name: count, dtype: int64

In [7]:
data.head()

,DATE,sector,layoffs,ticker,Date,price,log_return,year
0,2000-12-01,Accommodation and Food Services,133,XLY,2000-12-01,19.431828,NaN,2000
1,2001-01-01,Accommodation and Food Services,191,XLY,2001-01-01,21.745836,0.119083,2001
2,2001-02-01,Accommodation and Food Services,93,XLY,2001-02-01,20.193089,-0.071404,2001
3,2001-03-01,Accommodation and Food Services,207,XLY,2001-03-01,19.858204,-0.016584,2001
4,2001-04-01,Accommodation and Food Services,257,XLY,2001-04-01,20.821493,0.048508,2001

In [8]:
data['quarter'] = data['DATE'].dt.to_period('Q')
quarterly_data = data.groupby(['sector', 'quarter']).agg({
    'layoffs':'sum',
    'log_return':'mean'
}).reset_index()

                                          sector quarter  layoffs  log_return
0                Accommodation and Food Services  2000Q4      133         NaN
1                Accommodation and Food Services  2001Q1      491    0.010365
2                Accommodation and Food Services  2001Q2      568    0.020767
3                Accommodation and Food Services  2001Q3      642   -0.056588
4                Accommodation and Food Services  2001Q4      809    0.077602
...                                          ...     ...      ...         ...
1669  Transportation, Warehousing, and Utilities  2022Q4      324   -0.029435
1670  Transportation, Warehousing, and Utilities  2023Q1      576    0.053558
1671  Transportation, Warehousing, and Utilities  2023Q2      172    0.045730
1672  Transportation, Warehousing, and Utilities  2023Q3      224   -0.016412
1673  Transportation, Warehousing, and Utilities  2023Q4      384    0.038536

[1674 rows x 4 columns]

In [9]:
quarterly_data

                                          sector quarter  layoffs  log_return
0                Accommodation and Food Services  2000Q4      133         NaN
1                Accommodation and Food Services  2001Q1      491    0.010365
2                Accommodation and Food Services  2001Q2      568    0.020767
3                Accommodation and Food Services  2001Q3      642   -0.056588
4                Accommodation and Food Services  2001Q4      809    0.077602
...                                          ...     ...      ...         ...
1669  Transportation, Warehousing, and Utilities  2022Q4      324   -0.029435
1670  Transportation, Warehousing, and Utilities  2023Q1      576    0.053558
1671  Transportation, Warehousing, and Utilities  2023Q2      172    0.045730
1672  Transportation, Warehousing, and Utilities  2023Q3      224   -0.016412
1673  Transportation, Warehousing, and Utilities  2023Q4      384    0.038536

[1674 rows x 4 columns]